# ДЗ 19. Сделать Squash и Rebase комитов в ПР.

"""
+. Создать новый репозиторий.
2. Сделать пару комитов в master/main ветке.
3. Создать новую ветку feature_34.
4. Потом в мастере еще раз создать пару комитов.
5. Перейти на эту ветку и сделать пару комитов
   в ней. После чего сделать скриншот комитов,
   для того что бы можно было увидеть разницу
   до сквоша и ребейза и после.
6. Сделать сквош (gir rebase -i master).
7. Сделать ребейз (git rebase master).
8. Сделать скриншот результата и скинуть оба
   скрина как результат домашнего задания.
"""
